In [1]:
import numpy as np
import pandas as pd

In [4]:
filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,434,567], [566,534,572], [532,107,493]]

In [7]:
dataframe = pd.DataFrame(datos, filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [14]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572

In [19]:
dataframe['zonaA']

ventas1    123
ventas2    566
ventas3    532
Name: zonaA, dtype: int64

In [24]:
dataframe.loc['ventas1'] ['zonaB']

434

In [34]:
dataframe['VentasTotales'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [36]:
dataframe.drop('VentasTotales', axis = 1)

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [37]:
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [38]:
dataframe.drop('VentasTotales', axis = 1, inplace = True)

In [39]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [40]:
dataframe.drop("ventas2")

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [41]:
dataframe.shape

(3, 3)

In [42]:
dataframe.drop("ventas2", inplace=True)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [43]:
dataframe.shape

(2, 3)